@quixoticmonk Maybe this is helpful. Attaching a partial example of how the false drift is detected. It seems to be in the ordering of the properties in the asset_model_properties. The properties in the code are in one order and the list retrieved orders the properties differently. Sequence in the code is [id, voltage, battery_level]. Sequence in the data retrieved (it seems) is [battery_level, id, voltage]. Hope this is helpful. 

```
module.iot_sitewise.awscc_iotsitewise_asset_model.vdc: Drift detected (update) 

Terraform used the selected providers to generate the following execution 
plan. Resource actions are indicated with the following symbols: 
~ update in-place 

Terraform will perform the following actions: 

# module.iot_sitewise.awscc_iotsitewise_asset_model.vdc will be updated in-place 
~ resource "awscc_iotsitewise_asset_model" "vdc" { 
+ asset_model_composite_models = (known after apply) 
+ asset_model_hierarchies = (known after apply) 
~ asset_model_properties = [ 
~ { 
~ data_type = "DOUBLE" -> "STRING" 
+ data_type_spec = (known after apply) 
+ external_id = (known after apply) 
id = "198a47c3-ad10-4b08-a915-2db66eadd1f8" 
~ logical_id = "battery_level" -> "id" 
~ name = "battery_level" -> "id" 
~ type = { 
+ attribute = { 
+ default_value = "enter value here" 
} 
+ metric = (known after apply) 
+ transform = (known after apply) 
~ type_name = "Measurement" -> "Attribute" 
} 
# (1 unchanged attribute hidden) 
}, 
 ~ { 
~ data_type = "STRING" -> "DOUBLE" 
+ data_type_spec = (known after apply) 
+ external_id = (known after apply) 
id = "b554ec2d-ddf6-4fff-b11b-badfeeff57c0" 
~ logical_id = "id" -> "voltage" 
~ name = "id" -> "voltage" 
~ type = { 
+ metric = (known after apply) 
+ transform = (known after apply) 
~ type_name = "Attribute" -> "Measurement" 
# (1 unchanged attribute hidden) 
} 
+ unit = (known after apply) 
}, 
.
.
.
```